# Databricks notebook source
# MAGIC %run ../includes/configuration

# COMMAND ----------

from pyspark.sql import SparkSession
from pyspark.sql.functions import col, udf
from pyspark.sql.types import StringType
from collections import Counter

# COMMAND ----------

sectors_dict = {
    "التجهيز والنقل والماء": [
        "بناء", "مرفق", "صيانة",
        "طريق", "جسر", "ماء", "صرف صحي", "تجهيز",
        "بنية تحتية",  "قناطر",
        "صيانة", "الماء", "البنية التحتية",
        "قروية", "صالحة للشرب", "مياه", "فك العزلة",
        "سدود", "صالح للشرب", "للماء", "للسد", "مقالع",
        "فيضان", "مائي", "البنيات التحتية", "الربط", "شواطئ",
        "شاطئ", "جفاف", "المضاربين", "تطهير السائل",
        "عطش", " سد ", "قنطرة",

        "طريق", "سكة حديد", "مطار", "ميناء", "جوي ", "جوية ", "الجوية",
        "لوجستيات", "مرور", "تسجيل مركبة", "الرحلات",
        "بنية تحتية نقل", "طيران", "بحري", "سلامة طريق",
        "نقل", "شحن", "طريق سريع", "سيارات الأجرة", "الطرق", "سكك", "خطوط", "حافلات", "النقل",
        "رخصة السياقي", "قطار", "ناقلات", "فك العزلة", "مينائية", "موانئ",
        "حمولة", "سائق", "مركبات", "لوجستيك", "سيارات", "للطرق",
        "راجلين", "حوادت", "حوادث", "لوجيستيك", "الفحص التقني",
        "السير", "طرق", "الرصد الجوي", 
    ],
    "التعليم": [
        "مدرسة", "منهج", "معلم", "طالب", "تعليمية",
        "ثانوي", "تعلم", "تعليم", "باكالوريا", "طلبة",
        "أكاديمي", "تدريب مهني", "تكوين", "امتحان", "قسم",
        "جامعة", "كلية", "بحث", "أكاديمية", "محفظة",
        "منحة", "تمويل بحث", "أساتذة", "أستاذ", "التربية",
        "مؤسسة", "طالب", "ابتكار", "مدرسي", "مدرس", "تيسير", "تلاميذ", "دراسي",
        "أقسام", "مؤسسات", "سلك", "TaRL", "علمية", "بكالوريا",
        "تدريس", "دراسة", "تمدرس", "تلميذات", "مدارس", "محو الأمية", "الثانوي",
        "أمية", "جامعات", "جامعية", "جامعي", "التربية الوطنية", "كليات", "كلية",
        "دراسات", "بتكار", "علوم", "تربوي", "الإجازة", "الماستر", "شهادة",
        "شهادات", "اللغوية", "المفتشية", "الحركة الانتقالية", "حاضنة", "حضانات",
        "لغة", "الداخليات", "جيني", 
    ],
    "الشؤون الاجتماعية": [
        "رفاهية", "فقير", "مجتمع", "اجتماعية", "تشرد", "تسول", "تعاون",
        "سياسة اجتماعية", "اجتماعي", "مساعدة عامة", "أسرة", "هشة", "أسر",
        "رعاية كبار سن","خدمة صحة نفسية", "خدمة مكافحة إدمان", "زواج القاصرات", "قاصر",
        "برنامج رفاهية اجتماعية", "شبكة أمان اجتماعي", "خدمة متطوعين", "تدخل أزمة",
        "تأهيل اجتماعي", "دمج اجتماعي", "تضامن", "اجتماعي", "طفل", "فقر",
        "لغة الإشارة", "إعاقة", "إحتياجات خاصة", "إحتياجات الخاصة", "المسنين",
        "نساء", "الاحتياجات الخاصة", "أطفال", "المقاصة", "التقاعد", "نسائية",
        "متسول", "تكافل العائلي", "تكافل", "عائلي", "عائلة", "عازب", "طفولة", 
        "معوزين", "مسنين", "دعم", "مراكز الإيواء", "ايتام", "نسوية",
        "دار الطالب", "دور الطالب", "بطاقة معاق", "الرعاية الإجتماعية",

    ],
    "العدل": [
        "قانوني", "محكمة", "عدالة", "جنائية", "قانون", "قضاء",
        "جنائي", "مدني", "قضية", "قضائية", "دستور", "حق ",
        "حق إنسان", "تحكيم", "قانونية", "عدل", "معتقل",
        "سجون", "سجن", "قانون", "حقوق", "عقوبة", "عقوبات", "مسطرة",
        "غرامات", "عفو", "محام", "دفاع", "قوانين", "عقاب",
        "إعتداء"
    ],
    "الثقافة و الاتصال و التواصل": [
        "فن", "تراث", "متاحف", "مكتبة",
        "معرض", "متحف", "مهرجان", "سينما",
        "تاريخ", "ثقافي", "كتب", "أنشطة",
        "موسيقى", "أدب", "ثقافة", "ثقافية",
        "كتاب", "تلفزية", "قصبات", "ترميم",
        "موروث", "مسارح", "مسرح", "أثري", "أركيولوجي",
        "آثار", "نقوش", "القرن", "سنيما",
        "إعلام", "علاقة عامة", "اتصال", "تكنولوجيا معلومات", "بث",
        "وسائط رقمية", "صحف", "إدارة معلومات", "ثقافة",
        "إعلان", "إنشاء محتوى", "صحافة", "تلفزة", "إذاعة",
        "وسيلة تواصل اجتماعي", "نشر معلومات", "تدريب إعلام",
        "محتوى رقمي", "إعلام رقمي", "ADSL", "رقمي", "السمعي البصري",
        "هاتف", "انترنيت", "نقال", "صبيب", "تلفزية", "إنترنت", "أنترنيت",
        "قناة", "تلفزيون", "إشهار", "جرائد", "توعوية", "صحافيين",
        "قناتين", "تواصل", "أمازيغية", "مواقع", "لغة", "برامج",
        "المعاهد الموسيقية", "موسيقية", "موسيقى",
        "تثقيف", "أغنية", "اغنية", "شعر"
    ],
    "الشباب": [
        "برنامج", "شباب", "مراهقين",
        "توجيه مهني", "نشاط ترفيهي", "أنشطة", "تخييم",
    ],
    "الرياضة": [
        "رياضية", "رياضي", "لياقة", "مسابقة", "منتخب",
        "فريق", "أولمبي", "ملاعب", "رياضات",
        "أندية", "نادي", "كرة", "ملعب", "مركب",
        "لياقة بدنية", "رياضة", "أنشطة", "بادمنتون", "الجامعة الملكية",
        
    ],
    "الشؤون الخارجية": [
        "دبلوماسية", "علاقات دولية", "اتفاقية تجارة", "قنصلية", "سياسة خارجية",
        "علاقة ثنائية", "علاقة متعددة الأطراف", "سفارة", "منظمة دولية", "قضية عالمية",
        "مفاوضات دولية", "مساعدة خارجية", "بروتوكول دبلوماسي", "جغرافيا سياسية", "معاهدة دولية",
        "تجارة خارجية", "خدمة قنصلية", "حفظ سلام", "تبادل ثقافي", "تعاون دولي", "دبلوماسية عالمية",
        "تعاون ثنائي", "أمن دولي", "الخارجية"
    ],
    "الفلاحة": [
        "زراعة", "إنتاج محصول", "ماشية", "زراعية",
        "زراعي", "تربة", "زرع", "الري ", "أمن غذائي", "مزرعة",
        "حيوان", "قمح", "حبوب", "لري ", "مزارعين",
        "محصول", "الفلاحة", "فلاحة", "فلاح", "فلاحي",
        "دواجن", "أشجار", "زيتون", "حصاد", "السقي ",
        "زراعات", "حوامض", "لحوم", "المغرب الأخضر",
        "السقوية", "قطيع", "المجازر", "العلف", "المخطط الأخضر",
        "الجيل الأخضر", "بذور", "جفاف", "مزروعات"
    ],
    "الصيد": [
        "بحري", "استزراع مائي", "صيد مستدام", "مصايد",
        "بحر", "محيط", "سمك", "الصيد", "صيد",
        "سـمـك"
    ],
    "البيئة و التنمية المستدامة": [
        "بيئة", "مناخ", "تلوث", "طبيعة", "استدامة", "طبيعي",
        "بيئية", "إدارة نفايات", "خضراء", "شجرة", "أشجار",
        "بيولوجي", "متجددة", "إدارة موارد", "COP",
        "هواء", "بيئي", "غابات", "غابة", "حرائق",
        "النفايات", "غابوي", "النباتات النادرة", "حفاظ",
        "جفاف", "نفايات", "التنمية المستدامة", "تنمية مستدامة"
    ],
    "الإسكان": [
        "عقار", "إسكان", "تنمية حضرية", "استخدام أرض",
        "بناء", "مدن بدون صفيح", "التأهيل الحضري", "مدينة", "المدن", "للمدن",
        "تخطيط حضري", "تنظيم إسكان", "مشروع إسكان", "إدارة ممتلكات", "سكن",
        "تنمية مجتمعية", "استثمار عقار", "استراتيجية إسكان", "صيانة إسكان", "امتلاك منزل", "إسكان إيجاري",
        "سوق عقارات", "إسكان اجتماعي", "مباني", "إسكان",
        "تصاميم التهيئة", "العمرانية", "التعمير", "الأحياء",
        "المرافق الأساسي", "البنايات", "معمار",
        "وكالات حضرية", "وكالة حضرية", "الوكالة الحضرية", "الوكالات الحضرية",
        "دور الصفيح", "الصفيح", "عمران", "مدينة", "تجديد حضري",
        "بناء", "تخطيط حضري", "مبنى",   "الوسطاء"
    ],
    "الداخلية": [
        "أمن وطني", "شرطة", "خدمة طارئة", "حماية مدنية", "سياسة داخلية",
        "إنفاذ قانون", "سلامة عامة", "استعداد طوارئ", "إدارة كارثة", "دفاع مدني",
        "مراقبة حدود", "وقاية من جريمة", "أمن داخلي", "استجابة طوارئ", "مكافحة إرهاب",
        "نظام عام", "شرطة مجتمعية", "عملية أمنية", "خدمة حماية مدنية", "تخطيط طوارئ", "شؤون داخلية",
        "أمن عام", "تدابير أمنية", "الداخلية"
    ],
    "الصحة": [
        "مستشفى", "عيادة", "صحة عامة", "دواء",
        "تطعيم", "رعاية أولية", "وقاية", "طب نفسي", "بحث طبي",
        "إدارة صحة", "طوارئ صحية", "طبيب", "تغذية", "صحة بيئية",
        "تأمين", "صحة مجتمعية", "إنجابية", "تدريب طبي", "صحي", "صحية",
        "رعاية منزلية", "طب وقائي", "الصحة", "التغطية الصحية", "تغطية صحية",
        "الصحية", "صحة", "الصحي"
    ],
    "الصناعة و التجارة": [
        "تصنيع", "إنتاج", "صناعية", "منتج",
        "مصنع", "آلات", "صناعي", "صناعة",
        "الصناعة", "مصانع", "جودة", "صادرات",
        "منتوج", "نسيج", "قطاع", "تجار", "تجاري", "تجارة",
        "كيماوية", "مواد", 
    ],
    "الأوقاف والشؤون الإسلامية": [
        "الأوقاف والشؤون الإسلامية", "الأوقاف", "الشؤون الإسلامية", "إسلامية", "إسلام", "مسجد",
        "مساجد"
    ],
    "المقاولة و الشغل": [
        "الشغل", "التشغيل", "تشغيل", "شغل", "عمل", "الأجراء", "أجراء",
        "أجور", "الموارد البشرية", "موارد بشرية", "أوراش", "المقاولين الذاتيين",
        "المقاول الذاتي", "مقاول ذاتي", "اوراش", "العاملات",
        "العمال", "عقود", "اعوان",  "مقاول", "أوراش"
    ],
    "الطاقة و المعادن": [
        "الطاقة", "المعادن", "كهرباء", "الطاقي", "طاقة", "معادن",
        "بترول", "غاز طبيعي", "طاقات", "محروقات", "معدني",
        "منجم", "كهربة", "مناجم", "كهربائي", "إنارة", "فوسفاط", 
    ],
    "الاقتصاد": [
        "القدرة الشرائية", "استثمار", "اقتصادية",
        "اقتصادي", "سوق",  "اقتصاد",
        "ميزانية", "ضريبة", "إيراد", "بنك",
        "مالي", "نقدية", "خزينة",
        "مالية", "ضريبية", "أسواق", "صادرات",
        "تأمين", "ديون", "أسعار", "تضخم",
        "برنامج انطلاقة", "تسويق",
        "صندوق المقاصة", "تقاعد", "غلاء", "تمويل",
        "برنامج فرصة"
    ],
    "الإدارة": [
        "إدارة", "مرافق عمومية", "المرافق العمومية", "الموارد البشرية", "موارد بشرية", "توظيف",
        "الوظيفة العمومية", "وظيفة عمومية", "الفساد"
    ],
    "السياحة": [
        "سياح", "صناعة تقليدية", "الصناعة التقليدية", "الصانع التقليدي", "صانع تقليدي",
        "الصناع التقليديين", "صناع تقليديين", "الحرف التقليدية", "تقليدي", "حرفي",
        "صانع", "أسفار", "فنادق", "فندق", 
    ],
    "رئاسة الحكومة": [
        "حكومة", "برلمان", "البرنامج الحكومي"
    ],
}

fixed_sectors = {
    "السياحة": [
        "كتابة الدولة المكلفة بالسياحة"
    ],
    "العدل": [
        "العدل",
        "العدل والحريات",
        "المكلف بحقوق الإنسان"
    ],
    "الصناعة و التجارة": [
        "الصناعة والتجارة",
        "الصناعة والاستثمار والتجارة والاقتصاد الرقمي",
        "الصناعة والتجارة والاقتصاد الأخضر والرقمي",
        "كتابة الدولة المكلفة بالتجارة الخارجية",
        "وزير الصناعة والتجارة والاستثمار والاقتصاد الرقمي"
    ],
    "التجهيز والنقل والماء": [
        "النقل واللوجيستيك",
        "كتابة الدولة المكلفة بالنقل",
        "كتابة الدولة المكلفة بالماء",
        "التجهيز والماء",
        "التجهيز والنقل واللوجستيك والماء"
    ],
    "التعليم": [
        "التعليم العالي والبحث العلمي والابتكار",
        "التربية الوطنية والتكوين المهني والتعليم العالي والبحث العلمي",
        "وزير التربية الوطنية والتكوين المهني",
        "كتابة الدولة المكلفة بالتعليم العالي والبحث العلمي",
        "كتابة الدولة المكلفة بالتكوين المهني",
    ],
    "الإسكان": [
        "إعداد التراب الوطني والتعمير والإسكان وسياسة المدينة"
    ],
    "الشؤون الاجتماعية": [
        "التضامن والإدماج الاجتماعي والأسرة",
        "التضامن والتنمية الاجتماعية والمساواة والأسرة",
        "الأسرة والتضامن والمساواة والتنمية الاجتماعية"
    ],
    "الثقافة و الاتصال و التواصل": [
        "الثقافة والاتصال"
    ],
    "الشؤون الخارجية": [
        "الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج",
        "الوزارة المنتدبة لدى وزير الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج",
        "الوزارة المنتدبة لدى وزير الشؤون الخارجية والتعاون الدولي المكلفة بالتعاون الإفريقي",
        "كتابة الدولة لدى وزير الشؤون الخارجية والتعاون الدولي",
        "الشؤون الخارجية والتعاون الدولي",
        "الوزارة المنتدبة لدى وزير الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج، المكلفة بالمغاربة المقيمين بالخارج",
        "الوزارة المنتدبة المكلفة بالمغاربة المقيمين بالخارج وشؤون الهجرة"
    ],
    "الداخلية": [
        "الداخلية", "الوزارة المنتدبة لدى وزير الداخلية"
    ],
    "الصحة": [
        "الصحة", "الصحة والحماية الاجتماعية"
    ],
    "الصيد": [
        "كتابة الدولة المكلفة بالصيد البحري"
    ],
    "الإدارة": [
        "الوزارة المنتدبة المكلفة بإصلاح الإدارة وبالوظيفة العمومية"
    ],
    "الأوقاف والشؤون الإسلامية": [
        "الأوقاف والشؤون الإسلامية"
    ],
    "إدارة الدفاع الوطني": [
        "الوزارة المنتدبة المكلفة بإدارة الدفاع الوطني"
    ],
    "المقاولة و الشغل": [
        "الشغل والإدماج المهني",
        "الإدماج الاقتصادي والمقاولة الصغرى والتشغيل والكفاءات"
    ],
    "البيئة و التنمية المستدامة": [
        "كتابة الدولة المكلفة بالتنمية المستدامة"
    ],
    "الطاقة و المعادن": [
        "الانتقال الطاقي والتنمية المستدامة"
    ],
    "رئاسة الحكومة": [
        "رئيس الحكومة",
        "رئيس الحكومة سياسة عامة",
        "الوزارة المنتدبة المكلفة بالعلاقات مع البرلمان والمجتمع المدني الناطق الرسمي باسم الحكومة",
        "الأمانة العامة للحكومة",
        "الوزارة المنتدبة لدى رئيس الحكومة المكلفة.بالشؤون العامة والحكامة",
        "رئاسة الحكومة",
        "الوزارة المنتدبة المكلفة بالشؤون العامة والحكامة"
    ],
    "الاقتصاد": [
        "الاقتصاد والمالية",
        "كتابة الدولة المكلفة بالاستثمار"
    ]
}


# COMMAND ----------

sectors_dict_bc = spark.sparkContext.broadcast(sectors_dict)
fixed_sectors_dict_bc = spark.sparkContext.broadcast(fixed_sectors)

# COMMAND ----------

def top_sectors(sectors_list):
    sector_counter = Counter(sectors_list)
    max_count = max(sector_counter.values()) if sector_counter.values() else list()
    return [sector for sector, count in sector_counter.items() if count == max_count]

# COMMAND ----------

def classify_sectors(question_subject, question_content, ministry):
    sectors_dict = sectors_dict_bc.value
    fixed_sectors_dict = fixed_sectors_dict_bc.value
    question_sectors = list()
    ministry_sectors = list()
    for sector, keywords in sectors_dict.items():
        for keyword in keywords:
            if keyword in (question_subject or "") or keyword in (question_content or ""):
                question_sectors.append(sector)
            if keyword in (ministry or ""):
                ministry_sectors.append(sector)

    sectors = [sector for sector in question_sectors if sector in ministry_sectors]

    if not sectors:
        for sector, keywords in fixed_sectors_dict.items():
            for keyword in keywords:
                if keyword in (ministry or ""):
                    sectors.append(sector)

    if not sectors:
        return "غير مصنف"
    else:
        return top_sectors(sectors)[0]

classify_udf = udf(classify_sectors, StringType())

# COMMAND ----------

# def classify_question(question_subject, question_content):
#     sectors_dict = sectors_dict_bc.value
#     sectors = list()
#     for sector, keywords in sectors_dict.items():
#         for keyword in keywords:
#             if keyword in (question_subject or "") or keyword in (question_content or ""):
#                 sectors.append(sector)
#     if not sectors:
#         return "غير مصنف"
#     else:
#         return ", ".join(top_sectors(sectors))
    
# def classify_ministry(ministry):
#     sectors_dict = sectors_dict_bc.value
#     sectors = list()
#     for sector, keywords in sectors_dict.items():
#         for keyword in keywords:
#             if keyword in (ministry or ""):
#                 sectors.append(sector)
#     if not sectors:
#         return "غير مصنف"
#     else:
#         return ", ".join(top_sectors(sectors))

# classify_question_udf = udf(classify_question, StringType())
# classify_ministry_udf = udf(classify_ministry, StringType())

# COMMAND ----------

all_questions_df = spark.read\
    .parquet(f"{ingested_folder_path}/questions")

# COMMAND ----------

classified_questions_df = all_questions_df.withColumn(
    "sector",
    classify_udf(col("sujet"), col("question"), col("ministere"))
)

# COMMAND ----------

# write PARQUET
classified_questions_df.write.mode("overwrite").parquet(f"{ingested_folder_path}/classified_questions")
