# Databricks notebook source
# MAGIC %run ../includes/configuration

# COMMAND ----------

from pyspark.sql import SparkSession
from pyspark.sql.functions import col, udf
from pyspark.sql.types import StringType
from collections import Counter

# COMMAND ----------

ministries_dict = {
    10: {
        "رئاسة الحكومة": [
            "رئاسة الحكومة",
            "رئيس الحكومة",
            "الأمانة العامة للحكومة",
            "كتابة الدولة المكلفة بالاستثمار",
            "الوزارة المنتدبة المكلفة بالعلاقات مع البرلمان والمجتمع المدني الناطق الرسمي باسم الحكومة",
            "الوزارة المنتدبة المكلفة بالشؤون العامة والحكامة",
            "الوزارة المنتدبة لدى رئيس الحكومة المكلفة.بالشؤون العامة والحكامة",
            "رئيس الحكومة سياسة عامة",
            "العلاقات مع البرلمان والمجتمع المدني"
        ],
        "وزارة الدولة المكلفة بحقوق الإنسان": [
            "وزارة الدولة المكلفة بحقوق الإنسان",
            "وزير الدولة المكلف بحقوق الانسان والعلاقات مع البرلمان",
            "المكلف بحقوق الإنسان"
        ],
        "وزارة الداخلية": [
            "وزارة الداخلية",
            "الداخلية",
            "الوزارة المنتدبة لدى وزير الداخلية"
        ],
        "وزارة الشؤون الخارجية والتعاون الدولي": [
            "وزارة الشؤون الخارجية والتعاون الدولي",
            "الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج",
            "الوزارة المنتدبة لدى وزير الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج، المكلفة بالمغاربة المقيمين بالخارج",
            "الوزارة المنتدبة لدى وزير الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج",
            "كتابة الدولة لدى وزير الشؤون الخارجية والتعاون الدولي",
            "الشؤون الخارجية والتعاون الدولي",
            "الوزارة المنتدبة المكلفة بالمغاربة المقيمين بالخارج وشؤون الهجرة",
            "الوزارة المنتدبة لدى وزير الشؤون الخارجية والتعاون الدولي المكلفة بالتعاون الإفريقي",
            "الوزير المكلف بالمغاربة المقيمين بالخارج وشؤون الهجرة"
        ],
        "وزارة العدل والحريات": [
            "وزارة العدل",
            "العدل",
            "العدل والحريات",
            "العدل والحريات "
        ],
        "وزارة الأوقاف والشؤون الإسلامية": [
            "وزارة الأوقاف والشؤون الإسلامية",
            "الأوقاف والشؤون الإسلامية"
        ],
        "وزارة الفلاحة والصيد البحري والتنمية القروية والمياه والغابات": [
            "وزارة الفلاحة والصيد البحري والتنمية القروية والمياه والغابات",
            "الفلاحة والصيد البحري والتنمية القروية والمياه والغابات",
            "كتابة الدولة المكلفة بالتنمية القروية والمياه والغابات",
            "كتابة الدولة المكلفة بالصيد البحري",
            "الفلاحة والصيد البحري"
        ],
        "وزارة الاقتصاد والمالية وإصلاح الإدارة": [
            "وزارة الاقتصاد والمالية",
            "الاقتصاد والمالية وإصلاح الإدارة",
            "الوزارة المنتدبة المكلفة بإصلاح الإدارة وبالوظيفة العمومية",
            "الاقتصاد والمالية"
        ],
        "وزارة إعداد التراب الوطني والتعمير والإسكان وسياسة المدينة": [
            "وزارة إعداد التراب الوطني والتعمير والإسكان وسياسة المدينة",
            "إعداد التراب الوطني والتعمير والإسكان وسياسة المدينة",
            "كتابة الدولة المكلفة بالإسكان",
            "السكنى والتعمير وسياسة المدينة",
            "وزير السكنى وسياسة المدينة"
        ],
        "وزارة التربية الوطنية والتكوين المهني والتعليم العالي والبحث العلمي": [
            "الوزارة المنتدبة لدى وزير التربية الوطنية والتكوين المهني والتعليم العالي والبحث العلمي الناطق الرسمي باسم الحكومة، المكلفة بالتعليم العالي والبحث العلمي",
            "التربية الوطنية والتكوين المهني والتعليم العالي والبحث العلمي",
            "التربية الوطنية والتكوين المهني والتعليم العالي والبحث العلمي، الناطق الرسمي باسم الحكومة",
            "الوزارة المنتدبة لدى وزير التربية الوطنية والتكوين المهني والتعليم العالي والبحث العلمي، المكلفة بالتعليم العالي والبحث العلمي",
            "كتابة الدولة المكلفة بالتكوين المهني",
            "كتابة الدولة المكلفة بالتعليم العالي والبحث العلمي",
            "الوزيرة المنتدبة لدى وزير التعليم العالي والبحث العلمي وتكوين الأطر",
            "التعليم العالي والبحث العلمي وتكوين الأطر",
            "التربية الوطنية",
            "وزير التربية الوطنية والتكوين المهني",
            "الوزير المنتدب  لدى وزير التربية الوطنية والتكوين المهني"
        ],
        "وزارة الصناعة والاستثمار والتجارة والاقتصاد الرقمي": [
            "وزارة الصناعة والاستثمار والتجارة والاقتصاد الرقمي",
            "الصناعة والتجارة والاقتصاد الأخضر والرقمي",
            "كتابة الدولة المكلفة بالتجارة الخارجية",
            "الصناعة والاستثمار والتجارة والاقتصاد الرقمي",
            "وزير الصناعة والتجارة والاستثمار والاقتصاد الرقمي"
        ],
        "وزارة التجهيز والنقل واللوجستيك والماء": [
            "وزارة التجهيز والنقل واللوجستيك والماء",
            "التجهيز والنقل واللوجستيك والماء",
            "كتابة الدولة المكلفة بالنقل",
            "كتابة الدولة المكلفة بالماء",
            "الوزيرة المنتدبة  لدى وزير الطاقة والمعادن والماء والبيئة المكلفة بالماء",
            "التجهيز والنقل",
            "وزيرالتجهيز والنقل واللوجستيك"
        ],
        "وزارة الصحة": [
            "وزارة الصحة",
            "الصحة"
        ],
        "وزارة الطاقة والمعادن والتنمية المستدامة": [
            "وزارة الطاقة والمعادن والتنمية المستدامة",
            "الطاقة والمعادن والبيئة",
            "الطاقة والمعادن والتنمية المستدامة",
            "كتابة الدولة المكلفة بالتنمية المستدامة",
            "الطاقة والمعادن والماء والبيئة",
            "الوزيرة المنتدبة  لدى وزير الطاقة والمعادن والماء والبيئة المكلفة بالبيئة"
        ],
        "وزارة السياحة والنقل الجوي والصناعة التقليدية والاقتصاد الاجتماعي": [
            "وزارة السياحة والنقل الجوي والصناعة التقليدية والاقتصاد الاجتماعي",
            "السياحة والصناعة التقليدية والنقل الجوي والاقتصاد الاجتماعي",
            "كتابة الدولة المكلفة بالصناعة التقليدية والاقتصاد الاجتماعي",
            "السياحة والنقل الجوي والصناعة التقليدية والاقتصاد الاجتماعي",
            "كتابة الدولة المكلفة بالسياحة",
            "وزيرة الصناعة التقليدية والاقتصاد الاجتماعي والتضامني"
        ],
        "وزارة الثقافة و الشباب والرياضة": [
            "الثقافة والشباب والرياضة",
            "الثقافة والشباب والرياضة، الناطق الرسمي باسم الحكومة",
            "الشباب والرياضة"
        ],
        "وزارة الثقافة والاتصال": [
            "وزارة الثقافة والاتصال",
            "الثقافة والاتصال",
            "الاتصال",
            "الثقافة"
        ],
        "وزارة الأسرة والتضامن والمساواة والتنمية الاجتماعية": [
            "وزارة الأسرة والتضامن والمساواة والتنمية الاجتماعية",
            "التضامن والتنمية الاجتماعية والمساواة والأسرة",
            "الأسرة والتضامن والمساواة والتنمية الاجتماعية"
        ],
        "وزارة الشغل والإدماج المهني": [
            "وزارة الشغل والإدماج المهني",
            "الشغل والإدماج المهني",
            "وزير التشغيل والشؤون الاجتماعية"
        ],
        "الوزارة المنتدبة المكلفة بإدارة الدفاع الوطني": [
            "الوزارة المنتدبة المكلفة بإدارة الدفاع الوطني"
        ]
    },
    11: {
        "رئاسة الحكومة": [
            "رئيس الحكومة",
            "الأمانة العامة للحكومة",
            "الوزارة المنتدبة لدى رئيس الحكومة المكلفة بالاستثمار والتقائية وتقييم السياسات العمومية",
            "الوزارة المنتدبة لدى رئيس الحكومة المكلفة بالعلاقات مع البرلمان",
            "رئيس الحكومة سياسة عامة"
        ],
        "الوزارة المنتدبة لدى رئيس الحكومة المكلفة بالانتقال الرقمي وإصلاح الإدارة": [
            "الوزارة المنتدبة لدى رئيس الحكومة المكلفة بالانتقال الرقمي وإصلاح الإدارة"
        ],
        "الوزارة المنتدبة لدى رئيس الحكومة المكلفة بإدارة الدفاع الوطني": [
            "الوزارة المنتدبة لدى رئيس الحكومة المكلفة بإدارة الدفاع الوطني"
        ],
        "وزارة الداخلية": [
            "الداخلية"
        ],
        "وزارة الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج": [
            "الشؤون الخارجية والتعاون الإفريقي والمغاربة المقيمين بالخارج"
        ],
        "وزارة الأوقاف والشؤون الإسلامية": [
            "الأوقاف والشؤون الإسلامية"
        ],
        "وزارة الصحة والحماية الاجتماعية": [
            "الصحة والحماية الاجتماعية"
        ],
        "وزارة الاقتصاد والمالية": [
            "الاقتصاد والمالية",
            "الوزارة المنتدبة لدى وزيرة الاقتصاد والمالية المكلفة بالميزانية"
        ],
        "وزارة الفلاحة والصيد البحري والتنمية القروية والمياه والغابات": [
            "الفلاحة والصيد البحري والتنمية القروية والمياه والغابات"
        ],
        "وزارة السياحة والصناعة التقليدية والاقتصاد الاجتماعي والتضامني": [
            "السياحة والصناعة التقليدية والاقتصاد الاجتماعي والتضامني"
        ],
        "وزارة التربية الوطنية والتعليم الأولي والرياضة": [
            "التربية الوطنية والتعليم الأولي والرياضة"
        ],
        "وزارة التعليم العالي والبحث العلمي والابتكار": [
            "التعليم العالي والبحث العلمي والابتكار"
        ],
        "وزارة الإدماج الاقتصادي والمقاولة الصغرى والشغل والكفاءات": [
            "الإدماج الاقتصادي والمقاولة الصغرى والتشغيل والكفاءات"
        ],
        "وزارة العدل": [
            "العدل"
        ],
        "وزارة إعداد التراب الوطني والتعمير والإسكان وسياسة المدينة": [
            "إعداد التراب الوطني والتعمير والإسكان وسياسة المدينة"
        ],
        "وزارة الانتقال الطاقي والتنمية المستدامة": [
            "الانتقال الطاقي والتنمية المستدامة"
        ],
        "وزارة الشباب والثقافة والتواصل": [
            "الشباب والثقافة والتواصل"
        ],
        "وزارة التجهيز والماء": [
            "التجهيز والماء"
        ],
        "وزارة النقل واللوجيستيك": [
            "النقل واللوجيستيك"
        ],
        "وزارة الصناعة والتجارة": [
            "الصناعة والتجارة"
        ],
        "وزارة التضامن والإدماج الاجتماعي والأسرة": [
            "التضامن والإدماج الاجتماعي والأسرة"
        ],
    }
}

# COMMAND ----------

ministries_dict_bc = spark.sparkContext.broadcast(ministries_dict)

# COMMAND ----------

def classify_ministries(question_legislation, question_ministry):
    ministries_dict = ministries_dict_bc.value
    for ministry, sub_ministries in ministries_dict[question_legislation].items():
        for sub_ministry in sub_ministries:
            if sub_ministry in question_ministry:
                return ministry

classify_ministries_udf = udf(classify_ministries, StringType())

# COMMAND ----------

all_questions_df = spark.read\
    .parquet(f"{ingested_folder_path}/classified_questions")

# COMMAND ----------

classified_questions_df = all_questions_df.withColumn(
    "ministry_classified",
    classify_ministries_udf(col("legislation_id"), col("ministere"))
)

# COMMAND ----------

# write PARQUET
classified_questions_df.write.mode("overwrite").parquet(f"{ingested_folder_path}/classified_questions")
